#ifndef _SEEKFREE_INA219_H
#define _SEEKFREE_INA219_H

#include "common.h"
#include "SEEKFREE_SOFT_I2C.h"

//=================================================================================================================
//  宏定义
//=================================================================================================================

#define INA219_ADDRESS                      (0x40)  // A0 & A1 接 GND

//-------------------------------------------------------------------------------------------------------------------
//  @brief      寄存器地址
//-------------------------------------------------------------------------------------------------------------------
#define INA219_REG_CONFIG                   (0x00)  // 配置寄存器
#define INA219_REG_SHUNTVOLTAGE             (0x01)  // 采样电阻分压寄存器
#define INA219_REG_BUSVOLTAGE               (0x02)  // 总线电压寄存器
#define INA219_REG_POWER                    (0x03)  // 功率寄存器
#define INA219_REG_CURRENT                  (0x04)  // 电流寄存器
#define INA219_REG_CALIBRATION              (0x05)  // 校准寄存器

//-------------------------------------------------------------------------------------------------------------------
//  @brief      配置寄存器位域
//-------------------------------------------------------------------------------------------------------------------
#define INA219_CONFIG_BVOLTAGERANGE_32V         (0x2000)    // 0-32V
#define INA219_CONFIG_GAIN_8_320MV              (0x1800)    // Gain 8, 320mV
#define INA219_CONFIG_BADCRES_12BIT             (0x0180)    // 12-bit bus ADC
#define INA219_CONFIG_SADCRES_12BIT_128S_69MS   (0x0078)    // 12-bit shunt ADC, 128 samples, 69ms
#define INA219_CONFIG_MODE_SANDBVOLT_CONTINUOUS (0x0007)    // Shunt and bus, continuous

//=================================================================================================================
//  函数声明
//=================================================================================================================

void    ina219_init             (void);
float   ina219_get_bus_voltage  (void);
float   ina219_get_current      (void);
float   ina219_get_power        (void);

#endif 