/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2020,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897(已满)  三群：824575535
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		delay
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ790875685)
 * @version    		查看doc内version文件 版本说明
 * @Software 		MDK FOR C51 V9.60
 * @Target core		STC8H8K64S4
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2020-4-14
 ********************************************************************************************************************/


#include "zf_delay.h"
#include "board.h"
#include "intrins.h"

vuint16 zf_delay_ms = 0;
vuint16 zf_delay_us = 0;

//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数初始化
//  @param      NULL         
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_init(void)
{
	zf_delay_ms = sys_clk / 10000;
	zf_delay_us = sys_clk / 1000000 - 2;
	if(sys_clk <= 12000000) zf_delay_us++;

}
//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数
//  @param      x            	需要延时的时间（ms）
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_ms(uint16 ms)
{
	uint16 i;
	do {
			i = zf_delay_ms;
			while(--i);
	   }while(--ms);

}
//-------------------------------------------------------------------------------------------------------------------
//  @brief      软件延时函数(这是一个不准确的延时)
//  @param      x            	需要延时的时间（us）
//  @return     void
//  Sample usage:               无需用户调用，用户请使用h文件中的宏定义
//-------------------------------------------------------------------------------------------------------------------
void delay_us(uint32 us)
{
	P_SW2 |= 0x80; // 访问扩展寄存器 xsfr
	MD1U16 = us; //dat1 用户给定
	MD5U16 = zf_delay_us; //dat2 用户给定
	ARCON = 4 << 5; //16 位 *16 位 , 乘法模式
	OPCON = 1; // 启动计算
	while((OPCON & 1) != 0); // 等待计算完成
	ARCON = (1 << 5) + 6; //32 位左移模式
	OPCON = 1; // 启动计算
	while((OPCON & 1) != 0); // 等待计算完成
	us = MD3U32; //32 位结果
	
	while(us--);
}
